app/controllers/pages_controller.rb

  def index

=begin
	@tracks = Track.all
---
SELECT "tracks".* FROM "tracks"

  def map
    gon.tracks = Track.all
---
SELECT "tracks".* FROM "tracks"