app/controllers/tag_controller.rb

INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "chillout"], ["created_at", "2016-04-02 17:06:50.747374"], ["updated_at", "2016-04-02 17:06:50.747374"]]
---
  def create
    @tag = Tag.new(tag_params)
    if @tag.save