app/controllers/track_controller.rb

  def create
    @track = Track.new(track_params)
    if @track.save
---
INSERT INTO "tracks" ("name", "artist", "album", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Sapphire City"], ["artist", "Max Pekarsky"], ["album", "Max's Explo Music"], ["created_at", "2016-03-13 17:39:30.922803"], ["updated_at", "2016-03-13 17:39:30.922803"]]

  def update
    @track = Track.find(params[:id])
    if @track.update_attributes(track_params)
---
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = ? LIMIT 1  [["id", nil]]
UPDATE "tracks" SET "slow" = ?, "acoustic" = ?, "updated_at" = ? WHERE "tracks"."id" = ?  [["slow", 0], ["acoustic", 0], ["updated_at", "2016-10-14 21:45:57.042249"], ["id", 1]]