app/controllers/track_tag_controller.rb

 def new
    @tracktag = TrackTag.new
    @tags = Tag.all
    @tracks = Track.all
---
SELECT "tags".* FROM "tags"
SELECT "tracks".* FROM "tracks"

  def create
    @tracktag = TrackTag.new(track_tag_params)
    if @tracktag.save
---
INSERT INTO "track_tags" ("track_id", "tag_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["track_id", 1], ["tag_id", 3], ["created_at", "2016-03-18 00:07:15.399234"], ["updated_at", "2016-03-18 00:07:15.399234"]]