app/views/track/edit.html.erb

SELECT "tags".* FROM "tags"
SELECT "tags".* FROM "tags" INNER JOIN "track_tags" ON "tags"."id" = "track_tags"."tag_id" WHERE "track_tags"."track_id" = ? AND "tags"."id" = ?  [["track_id", 2], ["id", 1]]
---

    <% Tag.all.each do |tag| %>

        <%= check_box_tag "track[tag_ids][]", tag.id, @track.tags.include?(tag)  %>