app/views/track/find.html.erb

<h2>The closest track to <%= Track.find(params[:id]).name %> is:</h2>
---
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = ? LIMIT 1  [["id", 2]]