app/views/track/new.html.erb


    <% Tag.all.each do |tag| %>
---
SELECT "tags".* FROM "tags"